data/cfdb/validation/lid_driven_cavity_re1000/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0    0    0)      // 0
    (0.1  0    0)      // 1
    (0.1  0.1  0)      // 2
    (0    0.1  0)      // 3
    (0    0    0.01)   // 4
    (0.1  0    0.01)   // 5
    (0.1  0.1  0.01)   // 6
    (0    0.1  0.01)   // 7
);

blocks
(
    // 128x128 uniform: Re=1000 needs near-lid resolution; matches the
    // 129x129 finite-difference grid of Ghia et al. (1982) in density.
    hex (0 1 2 3 4 5 6 7) (128 128 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
